grevaillot/svd_tools/headers/ATSAMV71J19B/afec0.h
#pragma once 

/* --- AFEC0: Analog Front-End Controller --------------------------- */

/** @defgroup afec0_registers Analog Front-End Controller Register
@{*/

/** AFEC0_AFEC_CR AFEC Control Register **/
#define AFEC0_AFEC_CR			MMIO32(AFEC0_BASE + 0x00)
/** AFEC0_AFEC_MR AFEC Mode Register **/
#define AFEC0_AFEC_MR			MMIO32(AFEC0_BASE + 0x04)
/** AFEC0_AFEC_EMR AFEC Extended Mode Register **/
#define AFEC0_AFEC_EMR			MMIO32(AFEC0_BASE + 0x08)
/** AFEC0_AFEC_SEQ1R AFEC Channel Sequence 1 Register **/
#define AFEC0_AFEC_SEQ1R			MMIO32(AFEC0_BASE + 0x0c)
/** AFEC0_AFEC_SEQ2R AFEC Channel Sequence 2 Register **/
#define AFEC0_AFEC_SEQ2R			MMIO32(AFEC0_BASE + 0x10)
/** AFEC0_AFEC_CHER AFEC Channel Enable Register **/
#define AFEC0_AFEC_CHER			MMIO32(AFEC0_BASE + 0x14)
/** AFEC0_AFEC_CHDR AFEC Channel Disable Register **/
#define AFEC0_AFEC_CHDR			MMIO32(AFEC0_BASE + 0x18)
/** AFEC0_AFEC_CHSR AFEC Channel Status Register **/
#define AFEC0_AFEC_CHSR			MMIO32(AFEC0_BASE + 0x1c)
/** AFEC0_AFEC_LCDR AFEC Last Converted Data Register **/
#define AFEC0_AFEC_LCDR			MMIO32(AFEC0_BASE + 0x20)
/** AFEC0_AFEC_IER AFEC Interrupt Enable Register **/
#define AFEC0_AFEC_IER			MMIO32(AFEC0_BASE + 0x24)
/** AFEC0_AFEC_IDR AFEC Interrupt Disable Register **/
#define AFEC0_AFEC_IDR			MMIO32(AFEC0_BASE + 0x28)
/** AFEC0_AFEC_IMR AFEC Interrupt Mask Register **/
#define AFEC0_AFEC_IMR			MMIO32(AFEC0_BASE + 0x2c)
/** AFEC0_AFEC_ISR AFEC Interrupt Status Register **/
#define AFEC0_AFEC_ISR			MMIO32(AFEC0_BASE + 0x30)
/** AFEC0_AFEC_OVER AFEC Overrun Status Register **/
#define AFEC0_AFEC_OVER			MMIO32(AFEC0_BASE + 0x4c)
/** AFEC0_AFEC_CWR AFEC Compare Window Register **/
#define AFEC0_AFEC_CWR			MMIO32(AFEC0_BASE + 0x50)
/** AFEC0_AFEC_CGR AFEC Channel Gain Register **/
#define AFEC0_AFEC_CGR			MMIO32(AFEC0_BASE + 0x54)
/** AFEC0_AFEC_DIFFR AFEC Channel Differential Register **/
#define AFEC0_AFEC_DIFFR			MMIO32(AFEC0_BASE + 0x60)
/** AFEC0_AFEC_CSELR AFEC Channel Selection Register **/
#define AFEC0_AFEC_CSELR			MMIO32(AFEC0_BASE + 0x64)
/** AFEC0_AFEC_CDR AFEC Channel Data Register **/
#define AFEC0_AFEC_CDR			MMIO32(AFEC0_BASE + 0x68)
/** AFEC0_AFEC_COCR AFEC Channel Offset Compensation Register **/
#define AFEC0_AFEC_COCR			MMIO32(AFEC0_BASE + 0x6c)
/** AFEC0_AFEC_TEMPMR AFEC Temperature Sensor Mode Register **/
#define AFEC0_AFEC_TEMPMR			MMIO32(AFEC0_BASE + 0x70)
/** AFEC0_AFEC_TEMPCWR AFEC Temperature Compare Window Register **/
#define AFEC0_AFEC_TEMPCWR			MMIO32(AFEC0_BASE + 0x74)
/** AFEC0_AFEC_ACR AFEC Analog Control Register **/
#define AFEC0_AFEC_ACR			MMIO32(AFEC0_BASE + 0x94)
/** AFEC0_AFEC_SHMR AFEC Sample & Hold Mode Register **/
#define AFEC0_AFEC_SHMR			MMIO32(AFEC0_BASE + 0xa0)
/** AFEC0_AFEC_COSR AFEC Correction Select Register **/
#define AFEC0_AFEC_COSR			MMIO32(AFEC0_BASE + 0xd0)
/** AFEC0_AFEC_CVR AFEC Correction Values Register **/
#define AFEC0_AFEC_CVR			MMIO32(AFEC0_BASE + 0xd4)
/** AFEC0_AFEC_CECR AFEC Channel Error Correction Register **/
#define AFEC0_AFEC_CECR			MMIO32(AFEC0_BASE + 0xd8)
/** AFEC0_AFEC_WPMR AFEC Write Protection Mode Register **/
#define AFEC0_AFEC_WPMR			MMIO32(AFEC0_BASE + 0xe4)
/** AFEC0_AFEC_WPSR AFEC Write Protection Status Register **/
#define AFEC0_AFEC_WPSR			MMIO32(AFEC0_BASE + 0xe8)

/**@}*/


/** @defgroup afec0_afec_cr AFECCR AFEC Control Register
@{*/

/** AFEC0_AFEC_CR_START Start Conversion **/
#define AFEC0_AFEC_CR_START		(1 << 1)
/** AFEC0_AFEC_CR_SWRST Software Reset **/
#define AFEC0_AFEC_CR_SWRST		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_mr AFECMR AFEC Mode Register
@{*/

/** AFEC0_AFEC_MR_USEQ User Sequence Enable **/
#define AFEC0_AFEC_MR_USEQ		(1 << 31)

#define AFEC0_AFEC_MR_TRANSFER_SHIFT		28
#define AFEC0_AFEC_MR_TRANSFER_MASK		0x03
/** @defgroup afec0_afec_mr_transfer TRANSFER Transfer Period
@{*/
/**@}*/


#define AFEC0_AFEC_MR_TRACKTIM_SHIFT		24
#define AFEC0_AFEC_MR_TRACKTIM_MASK		0x0f
/** @defgroup afec0_afec_mr_tracktim TRACKTIM Tracking Time
@{*/
/**@}*/

/** AFEC0_AFEC_MR_ONE One **/
#define AFEC0_AFEC_MR_ONE		(1 << 23)

#define AFEC0_AFEC_MR_STARTUP_SHIFT		16
#define AFEC0_AFEC_MR_STARTUP_MASK		0x0f
/** @defgroup afec0_afec_mr_startup STARTUP Start-up Time
@{*/
/**@}*/


#define AFEC0_AFEC_MR_PRESCAL_SHIFT		8
#define AFEC0_AFEC_MR_PRESCAL_MASK		0xff
/** @defgroup afec0_afec_mr_prescal PRESCAL Prescaler Rate Selection
@{*/
/**@}*/

/** AFEC0_AFEC_MR_FREERUN Free Run Mode **/
#define AFEC0_AFEC_MR_FREERUN		(1 << 7)
/** AFEC0_AFEC_MR_FWUP Fast Wake-up **/
#define AFEC0_AFEC_MR_FWUP		(1 << 6)
/** AFEC0_AFEC_MR_SLEEP Sleep Mode **/
#define AFEC0_AFEC_MR_SLEEP		(1 << 5)

#define AFEC0_AFEC_MR_TRGSEL_SHIFT		1
#define AFEC0_AFEC_MR_TRGSEL_MASK		0x07
/** @defgroup afec0_afec_mr_trgsel TRGSEL Trigger Selection
@{*/
/**@}*/

/** AFEC0_AFEC_MR_TRGEN Trigger Enable **/
#define AFEC0_AFEC_MR_TRGEN		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_emr AFECEMR AFEC Extended Mode Register
@{*/


#define AFEC0_AFEC_EMR_SIGNMODE_SHIFT		28
#define AFEC0_AFEC_EMR_SIGNMODE_MASK		0x03
/** @defgroup afec0_afec_emr_signmode SIGNMODE Sign Mode
@{*/
/**@}*/

/** AFEC0_AFEC_EMR_STM Single Trigger Mode **/
#define AFEC0_AFEC_EMR_STM		(1 << 25)
/** AFEC0_AFEC_EMR_TAG TAG of the AFEC_LDCR **/
#define AFEC0_AFEC_EMR_TAG		(1 << 24)

#define AFEC0_AFEC_EMR_RES_SHIFT		16
#define AFEC0_AFEC_EMR_RES_MASK		0x07
/** @defgroup afec0_afec_emr_res RES Resolution
@{*/
/**@}*/


#define AFEC0_AFEC_EMR_CMPFILTER_SHIFT		12
#define AFEC0_AFEC_EMR_CMPFILTER_MASK		0x03
/** @defgroup afec0_afec_emr_cmpfilter CMPFILTER Compare Event Filtering
@{*/
/**@}*/

/** AFEC0_AFEC_EMR_CMPALL Compare All Channels **/
#define AFEC0_AFEC_EMR_CMPALL		(1 << 9)

#define AFEC0_AFEC_EMR_CMPSEL_SHIFT		3
#define AFEC0_AFEC_EMR_CMPSEL_MASK		0x1f
/** @defgroup afec0_afec_emr_cmpsel CMPSEL Comparison Selected Channel
@{*/
/**@}*/


#define AFEC0_AFEC_EMR_CMPMODE_SHIFT		0
#define AFEC0_AFEC_EMR_CMPMODE_MASK		0x03
/** @defgroup afec0_afec_emr_cmpmode CMPMODE Comparison Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_seq1r AFECSEQ1R AFEC Channel Sequence 1 Register
@{*/


#define AFEC0_AFEC_SEQ1R_USCH7_SHIFT		28
#define AFEC0_AFEC_SEQ1R_USCH7_MASK		0x0f
/** @defgroup afec0_afec_seq1r_usch7 USCH7 User Sequence Number 7
@{*/
/**@}*/


#define AFEC0_AFEC_SEQ1R_USCH6_SHIFT		24
#define AFEC0_AFEC_SEQ1R_USCH6_MASK		0x0f
/** @defgroup afec0_afec_seq1r_usch6 USCH6 User Sequence Number 6
@{*/
/**@}*/


#define AFEC0_AFEC_SEQ1R_USCH5_SHIFT		20
#define AFEC0_AFEC_SEQ1R_USCH5_MASK		0x0f
/** @defgroup afec0_afec_seq1r_usch5 USCH5 User Sequence Number 5
@{*/
/**@}*/


