grevaillot/svd_tools/headers/ATSAMV71J19B/afec0.h
#define AFEC0_AFEC_SEQ1R_USCH4_SHIFT		16
#define AFEC0_AFEC_SEQ1R_USCH4_MASK		0x0f
/** @defgroup afec0_afec_seq1r_usch4 USCH4 User Sequence Number 4
@{*/
/**@}*/


#define AFEC0_AFEC_SEQ1R_USCH3_SHIFT		12
#define AFEC0_AFEC_SEQ1R_USCH3_MASK		0x0f
/** @defgroup afec0_afec_seq1r_usch3 USCH3 User Sequence Number 3
@{*/
/**@}*/


#define AFEC0_AFEC_SEQ1R_USCH2_SHIFT		8
#define AFEC0_AFEC_SEQ1R_USCH2_MASK		0x0f
/** @defgroup afec0_afec_seq1r_usch2 USCH2 User Sequence Number 2
@{*/
/**@}*/


#define AFEC0_AFEC_SEQ1R_USCH1_SHIFT		4
#define AFEC0_AFEC_SEQ1R_USCH1_MASK		0x0f
/** @defgroup afec0_afec_seq1r_usch1 USCH1 User Sequence Number 1
@{*/
/**@}*/


#define AFEC0_AFEC_SEQ1R_USCH0_SHIFT		0
#define AFEC0_AFEC_SEQ1R_USCH0_MASK		0x0f
/** @defgroup afec0_afec_seq1r_usch0 USCH0 User Sequence Number 0
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_seq2r AFECSEQ2R AFEC Channel Sequence 2 Register
@{*/


#define AFEC0_AFEC_SEQ2R_USCH11_SHIFT		12
#define AFEC0_AFEC_SEQ2R_USCH11_MASK		0x0f
/** @defgroup afec0_afec_seq2r_usch11 USCH11 User Sequence Number 11
@{*/
/**@}*/


#define AFEC0_AFEC_SEQ2R_USCH10_SHIFT		8
#define AFEC0_AFEC_SEQ2R_USCH10_MASK		0x0f
/** @defgroup afec0_afec_seq2r_usch10 USCH10 User Sequence Number 10
@{*/
/**@}*/


#define AFEC0_AFEC_SEQ2R_USCH9_SHIFT		4
#define AFEC0_AFEC_SEQ2R_USCH9_MASK		0x0f
/** @defgroup afec0_afec_seq2r_usch9 USCH9 User Sequence Number 9
@{*/
/**@}*/


#define AFEC0_AFEC_SEQ2R_USCH8_SHIFT		0
#define AFEC0_AFEC_SEQ2R_USCH8_MASK		0x0f
/** @defgroup afec0_afec_seq2r_usch8 USCH8 User Sequence Number 8
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_cher AFECCHER AFEC Channel Enable Register
@{*/

/** AFEC0_AFEC_CHER_CH11 Channel 11 Enable **/
#define AFEC0_AFEC_CHER_CH11		(1 << 11)
/** AFEC0_AFEC_CHER_CH10 Channel 10 Enable **/
#define AFEC0_AFEC_CHER_CH10		(1 << 10)
/** AFEC0_AFEC_CHER_CH9 Channel 9 Enable **/
#define AFEC0_AFEC_CHER_CH9		(1 << 9)
/** AFEC0_AFEC_CHER_CH8 Channel 8 Enable **/
#define AFEC0_AFEC_CHER_CH8		(1 << 8)
/** AFEC0_AFEC_CHER_CH7 Channel 7 Enable **/
#define AFEC0_AFEC_CHER_CH7		(1 << 7)
/** AFEC0_AFEC_CHER_CH6 Channel 6 Enable **/
#define AFEC0_AFEC_CHER_CH6		(1 << 6)
/** AFEC0_AFEC_CHER_CH5 Channel 5 Enable **/
#define AFEC0_AFEC_CHER_CH5		(1 << 5)
/** AFEC0_AFEC_CHER_CH4 Channel 4 Enable **/
#define AFEC0_AFEC_CHER_CH4		(1 << 4)
/** AFEC0_AFEC_CHER_CH3 Channel 3 Enable **/
#define AFEC0_AFEC_CHER_CH3		(1 << 3)
/** AFEC0_AFEC_CHER_CH2 Channel 2 Enable **/
#define AFEC0_AFEC_CHER_CH2		(1 << 2)
/** AFEC0_AFEC_CHER_CH1 Channel 1 Enable **/
#define AFEC0_AFEC_CHER_CH1		(1 << 1)
/** AFEC0_AFEC_CHER_CH0 Channel 0 Enable **/
#define AFEC0_AFEC_CHER_CH0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_chdr AFECCHDR AFEC Channel Disable Register
@{*/

/** AFEC0_AFEC_CHDR_CH11 Channel 11 Disable **/
#define AFEC0_AFEC_CHDR_CH11		(1 << 11)
/** AFEC0_AFEC_CHDR_CH10 Channel 10 Disable **/
#define AFEC0_AFEC_CHDR_CH10		(1 << 10)
/** AFEC0_AFEC_CHDR_CH9 Channel 9 Disable **/
#define AFEC0_AFEC_CHDR_CH9		(1 << 9)
/** AFEC0_AFEC_CHDR_CH8 Channel 8 Disable **/
#define AFEC0_AFEC_CHDR_CH8		(1 << 8)
/** AFEC0_AFEC_CHDR_CH7 Channel 7 Disable **/
#define AFEC0_AFEC_CHDR_CH7		(1 << 7)
/** AFEC0_AFEC_CHDR_CH6 Channel 6 Disable **/
#define AFEC0_AFEC_CHDR_CH6		(1 << 6)
/** AFEC0_AFEC_CHDR_CH5 Channel 5 Disable **/
#define AFEC0_AFEC_CHDR_CH5		(1 << 5)
/** AFEC0_AFEC_CHDR_CH4 Channel 4 Disable **/
#define AFEC0_AFEC_CHDR_CH4		(1 << 4)
/** AFEC0_AFEC_CHDR_CH3 Channel 3 Disable **/
#define AFEC0_AFEC_CHDR_CH3		(1 << 3)
/** AFEC0_AFEC_CHDR_CH2 Channel 2 Disable **/
#define AFEC0_AFEC_CHDR_CH2		(1 << 2)
/** AFEC0_AFEC_CHDR_CH1 Channel 1 Disable **/
#define AFEC0_AFEC_CHDR_CH1		(1 << 1)
/** AFEC0_AFEC_CHDR_CH0 Channel 0 Disable **/
#define AFEC0_AFEC_CHDR_CH0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_chsr AFECCHSR AFEC Channel Status Register
@{*/

/** AFEC0_AFEC_CHSR_CH11 Channel 11 Status **/
#define AFEC0_AFEC_CHSR_CH11		(1 << 11)
/** AFEC0_AFEC_CHSR_CH10 Channel 10 Status **/
#define AFEC0_AFEC_CHSR_CH10		(1 << 10)
/** AFEC0_AFEC_CHSR_CH9 Channel 9 Status **/
#define AFEC0_AFEC_CHSR_CH9		(1 << 9)
/** AFEC0_AFEC_CHSR_CH8 Channel 8 Status **/
#define AFEC0_AFEC_CHSR_CH8		(1 << 8)
/** AFEC0_AFEC_CHSR_CH7 Channel 7 Status **/
#define AFEC0_AFEC_CHSR_CH7		(1 << 7)
/** AFEC0_AFEC_CHSR_CH6 Channel 6 Status **/
#define AFEC0_AFEC_CHSR_CH6		(1 << 6)
/** AFEC0_AFEC_CHSR_CH5 Channel 5 Status **/
#define AFEC0_AFEC_CHSR_CH5		(1 << 5)
/** AFEC0_AFEC_CHSR_CH4 Channel 4 Status **/
#define AFEC0_AFEC_CHSR_CH4		(1 << 4)
/** AFEC0_AFEC_CHSR_CH3 Channel 3 Status **/
#define AFEC0_AFEC_CHSR_CH3		(1 << 3)
/** AFEC0_AFEC_CHSR_CH2 Channel 2 Status **/
#define AFEC0_AFEC_CHSR_CH2		(1 << 2)
/** AFEC0_AFEC_CHSR_CH1 Channel 1 Status **/
#define AFEC0_AFEC_CHSR_CH1		(1 << 1)
/** AFEC0_AFEC_CHSR_CH0 Channel 0 Status **/
#define AFEC0_AFEC_CHSR_CH0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_lcdr AFECLCDR AFEC Last Converted Data Register
@{*/


#define AFEC0_AFEC_LCDR_CHNB_SHIFT		24
#define AFEC0_AFEC_LCDR_CHNB_MASK		0x0f
/** @defgroup afec0_afec_lcdr_chnb CHNB Channel Number
@{*/
/**@}*/


#define AFEC0_AFEC_LCDR_LDATA_SHIFT		0
#define AFEC0_AFEC_LCDR_LDATA_MASK		0xffff
/** @defgroup afec0_afec_lcdr_ldata LDATA Last Data Converted
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_ier AFECIER AFEC Interrupt Enable Register
@{*/

/** AFEC0_AFEC_IER_TEMPCHG Temperature Change Interrupt Enable **/
#define AFEC0_AFEC_IER_TEMPCHG		(1 << 30)
/** AFEC0_AFEC_IER_COMPE Comparison Event Interrupt Enable **/
#define AFEC0_AFEC_IER_COMPE		(1 << 26)
/** AFEC0_AFEC_IER_GOVRE General Overrun Error Interrupt Enable **/
#define AFEC0_AFEC_IER_GOVRE		(1 << 25)
/** AFEC0_AFEC_IER_DRDY Data Ready Interrupt Enable **/
#define AFEC0_AFEC_IER_DRDY		(1 << 24)
/** AFEC0_AFEC_IER_EOC11 End of Conversion Interrupt Enable 11 **/
#define AFEC0_AFEC_IER_EOC11		(1 << 11)
/** AFEC0_AFEC_IER_EOC10 End of Conversion Interrupt Enable 10 **/
#define AFEC0_AFEC_IER_EOC10		(1 << 10)
/** AFEC0_AFEC_IER_EOC9 End of Conversion Interrupt Enable 9 **/
#define AFEC0_AFEC_IER_EOC9		(1 << 9)
/** AFEC0_AFEC_IER_EOC8 End of Conversion Interrupt Enable 8 **/
#define AFEC0_AFEC_IER_EOC8		(1 << 8)
/** AFEC0_AFEC_IER_EOC7 End of Conversion Interrupt Enable 7 **/
#define AFEC0_AFEC_IER_EOC7		(1 << 7)
/** AFEC0_AFEC_IER_EOC6 End of Conversion Interrupt Enable 6 **/
#define AFEC0_AFEC_IER_EOC6		(1 << 6)
/** AFEC0_AFEC_IER_EOC5 End of Conversion Interrupt Enable 5 **/
#define AFEC0_AFEC_IER_EOC5		(1 << 5)
/** AFEC0_AFEC_IER_EOC4 End of Conversion Interrupt Enable 4 **/
#define AFEC0_AFEC_IER_EOC4		(1 << 4)
/** AFEC0_AFEC_IER_EOC3 End of Conversion Interrupt Enable 3 **/
#define AFEC0_AFEC_IER_EOC3		(1 << 3)
/** AFEC0_AFEC_IER_EOC2 End of Conversion Interrupt Enable 2 **/
#define AFEC0_AFEC_IER_EOC2		(1 << 2)
/** AFEC0_AFEC_IER_EOC1 End of Conversion Interrupt Enable 1 **/
#define AFEC0_AFEC_IER_EOC1		(1 << 1)
/** AFEC0_AFEC_IER_EOC0 End of Conversion Interrupt Enable 0 **/
#define AFEC0_AFEC_IER_EOC0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_idr AFECIDR AFEC Interrupt Disable Register
@{*/

/** AFEC0_AFEC_IDR_TEMPCHG Temperature Change Interrupt Disable **/
#define AFEC0_AFEC_IDR_TEMPCHG		(1 << 30)
/** AFEC0_AFEC_IDR_COMPE Comparison Event Interrupt Disable **/
#define AFEC0_AFEC_IDR_COMPE		(1 << 26)
/** AFEC0_AFEC_IDR_GOVRE General Overrun Error Interrupt Disable **/
#define AFEC0_AFEC_IDR_GOVRE		(1 << 25)
/** AFEC0_AFEC_IDR_DRDY Data Ready Interrupt Disable **/
#define AFEC0_AFEC_IDR_DRDY		(1 << 24)
/** AFEC0_AFEC_IDR_EOC11 End of Conversion Interrupt Disable 11 **/
#define AFEC0_AFEC_IDR_EOC11		(1 << 11)
/** AFEC0_AFEC_IDR_EOC10 End of Conversion Interrupt Disable 10 **/
#define AFEC0_AFEC_IDR_EOC10		(1 << 10)
/** AFEC0_AFEC_IDR_EOC9 End of Conversion Interrupt Disable 9 **/
#define AFEC0_AFEC_IDR_EOC9		(1 << 9)
/** AFEC0_AFEC_IDR_EOC8 End of Conversion Interrupt Disable 8 **/
#define AFEC0_AFEC_IDR_EOC8		(1 << 8)
/** AFEC0_AFEC_IDR_EOC7 End of Conversion Interrupt Disable 7 **/
#define AFEC0_AFEC_IDR_EOC7		(1 << 7)
/** AFEC0_AFEC_IDR_EOC6 End of Conversion Interrupt Disable 6 **/
#define AFEC0_AFEC_IDR_EOC6		(1 << 6)
/** AFEC0_AFEC_IDR_EOC5 End of Conversion Interrupt Disable 5 **/
#define AFEC0_AFEC_IDR_EOC5		(1 << 5)
/** AFEC0_AFEC_IDR_EOC4 End of Conversion Interrupt Disable 4 **/
#define AFEC0_AFEC_IDR_EOC4		(1 << 4)
/** AFEC0_AFEC_IDR_EOC3 End of Conversion Interrupt Disable 3 **/
#define AFEC0_AFEC_IDR_EOC3		(1 << 3)
/** AFEC0_AFEC_IDR_EOC2 End of Conversion Interrupt Disable 2 **/
#define AFEC0_AFEC_IDR_EOC2		(1 << 2)
/** AFEC0_AFEC_IDR_EOC1 End of Conversion Interrupt Disable 1 **/
#define AFEC0_AFEC_IDR_EOC1		(1 << 1)
/** AFEC0_AFEC_IDR_EOC0 End of Conversion Interrupt Disable 0 **/
#define AFEC0_AFEC_IDR_EOC0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_imr AFECIMR AFEC Interrupt Mask Register
@{*/

/** AFEC0_AFEC_IMR_TEMPCHG Temperature Change Interrupt Mask **/
#define AFEC0_AFEC_IMR_TEMPCHG		(1 << 30)
/** AFEC0_AFEC_IMR_COMPE Comparison Event Interrupt Mask **/
#define AFEC0_AFEC_IMR_COMPE		(1 << 26)
/** AFEC0_AFEC_IMR_GOVRE General Overrun Error Interrupt Mask **/
#define AFEC0_AFEC_IMR_GOVRE		(1 << 25)
/** AFEC0_AFEC_IMR_DRDY Data Ready Interrupt Mask **/
#define AFEC0_AFEC_IMR_DRDY		(1 << 24)
/** AFEC0_AFEC_IMR_EOC11 End of Conversion Interrupt Mask 11 **/
#define AFEC0_AFEC_IMR_EOC11		(1 << 11)
/** AFEC0_AFEC_IMR_EOC10 End of Conversion Interrupt Mask 10 **/
#define AFEC0_AFEC_IMR_EOC10		(1 << 10)
/** AFEC0_AFEC_IMR_EOC9 End of Conversion Interrupt Mask 9 **/
#define AFEC0_AFEC_IMR_EOC9		(1 << 9)
/** AFEC0_AFEC_IMR_EOC8 End of Conversion Interrupt Mask 8 **/
#define AFEC0_AFEC_IMR_EOC8		(1 << 8)
/** AFEC0_AFEC_IMR_EOC7 End of Conversion Interrupt Mask 7 **/
#define AFEC0_AFEC_IMR_EOC7		(1 << 7)
/** AFEC0_AFEC_IMR_EOC6 End of Conversion Interrupt Mask 6 **/
#define AFEC0_AFEC_IMR_EOC6		(1 << 6)
/** AFEC0_AFEC_IMR_EOC5 End of Conversion Interrupt Mask 5 **/
#define AFEC0_AFEC_IMR_EOC5		(1 << 5)
/** AFEC0_AFEC_IMR_EOC4 End of Conversion Interrupt Mask 4 **/
#define AFEC0_AFEC_IMR_EOC4		(1 << 4)
/** AFEC0_AFEC_IMR_EOC3 End of Conversion Interrupt Mask 3 **/
#define AFEC0_AFEC_IMR_EOC3		(1 << 3)
/** AFEC0_AFEC_IMR_EOC2 End of Conversion Interrupt Mask 2 **/
#define AFEC0_AFEC_IMR_EOC2		(1 << 2)
/** AFEC0_AFEC_IMR_EOC1 End of Conversion Interrupt Mask 1 **/
#define AFEC0_AFEC_IMR_EOC1		(1 << 1)
/** AFEC0_AFEC_IMR_EOC0 End of Conversion Interrupt Mask 0 **/
#define AFEC0_AFEC_IMR_EOC0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_isr AFECISR AFEC Interrupt Status Register
@{*/

