grevaillot/svd_tools/headers/ATSAMV71J19B/afec0.h
/** @defgroup afec0_afec_cdr AFECCDR AFEC Channel Data Register
@{*/


#define AFEC0_AFEC_CDR_DATA_SHIFT		0
#define AFEC0_AFEC_CDR_DATA_MASK		0xffff
/** @defgroup afec0_afec_cdr_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_cocr AFECCOCR AFEC Channel Offset Compensation Register
@{*/


#define AFEC0_AFEC_COCR_AOFF_SHIFT		0
#define AFEC0_AFEC_COCR_AOFF_MASK		0x3ff
/** @defgroup afec0_afec_cocr_aoff AOFF Analog Offset
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_tempmr AFECTEMPMR AFEC Temperature Sensor Mode Register
@{*/


#define AFEC0_AFEC_TEMPMR_TEMPCMPMOD_SHIFT		4
#define AFEC0_AFEC_TEMPMR_TEMPCMPMOD_MASK		0x03
/** @defgroup afec0_afec_tempmr_tempcmpmod TEMPCMPMOD Temperature Comparison Mode
@{*/
/**@}*/

/** AFEC0_AFEC_TEMPMR_RTCT Temperature Sensor RTC Trigger Mode **/
#define AFEC0_AFEC_TEMPMR_RTCT		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_tempcwr AFECTEMPCWR AFEC Temperature Compare Window Register
@{*/


#define AFEC0_AFEC_TEMPCWR_THIGHTHRES_SHIFT		16
#define AFEC0_AFEC_TEMPCWR_THIGHTHRES_MASK		0xffff
/** @defgroup afec0_afec_tempcwr_thighthres THIGHTHRES Temperature High Threshold
@{*/
/**@}*/


#define AFEC0_AFEC_TEMPCWR_TLOWTHRES_SHIFT		0
#define AFEC0_AFEC_TEMPCWR_TLOWTHRES_MASK		0xffff
/** @defgroup afec0_afec_tempcwr_tlowthres TLOWTHRES Temperature Low Threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_acr AFECACR AFEC Analog Control Register
@{*/


#define AFEC0_AFEC_ACR_IBCTL_SHIFT		8
#define AFEC0_AFEC_ACR_IBCTL_MASK		0x03
/** @defgroup afec0_afec_acr_ibctl IBCTL AFE Bias Current Control
@{*/
/**@}*/

/** AFEC0_AFEC_ACR_PGA1EN PGA1 Enable **/
#define AFEC0_AFEC_ACR_PGA1EN		(1 << 3)
/** AFEC0_AFEC_ACR_PGA0EN PGA0 Enable **/
#define AFEC0_AFEC_ACR_PGA0EN		(1 << 2)

/**@}*/

/** @defgroup afec0_afec_shmr AFECSHMR AFEC Sample & Hold Mode Register
@{*/

/** AFEC0_AFEC_SHMR_DUAL11 Dual Sample & Hold for channel 11 **/
#define AFEC0_AFEC_SHMR_DUAL11		(1 << 11)
/** AFEC0_AFEC_SHMR_DUAL10 Dual Sample & Hold for channel 10 **/
#define AFEC0_AFEC_SHMR_DUAL10		(1 << 10)
/** AFEC0_AFEC_SHMR_DUAL9 Dual Sample & Hold for channel 9 **/
#define AFEC0_AFEC_SHMR_DUAL9		(1 << 9)
/** AFEC0_AFEC_SHMR_DUAL8 Dual Sample & Hold for channel 8 **/
#define AFEC0_AFEC_SHMR_DUAL8		(1 << 8)
/** AFEC0_AFEC_SHMR_DUAL7 Dual Sample & Hold for channel 7 **/
#define AFEC0_AFEC_SHMR_DUAL7		(1 << 7)
/** AFEC0_AFEC_SHMR_DUAL6 Dual Sample & Hold for channel 6 **/
#define AFEC0_AFEC_SHMR_DUAL6		(1 << 6)
/** AFEC0_AFEC_SHMR_DUAL5 Dual Sample & Hold for channel 5 **/
#define AFEC0_AFEC_SHMR_DUAL5		(1 << 5)
/** AFEC0_AFEC_SHMR_DUAL4 Dual Sample & Hold for channel 4 **/
#define AFEC0_AFEC_SHMR_DUAL4		(1 << 4)
/** AFEC0_AFEC_SHMR_DUAL3 Dual Sample & Hold for channel 3 **/
#define AFEC0_AFEC_SHMR_DUAL3		(1 << 3)
/** AFEC0_AFEC_SHMR_DUAL2 Dual Sample & Hold for channel 2 **/
#define AFEC0_AFEC_SHMR_DUAL2		(1 << 2)
/** AFEC0_AFEC_SHMR_DUAL1 Dual Sample & Hold for channel 1 **/
#define AFEC0_AFEC_SHMR_DUAL1		(1 << 1)
/** AFEC0_AFEC_SHMR_DUAL0 Dual Sample & Hold for channel 0 **/
#define AFEC0_AFEC_SHMR_DUAL0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_cosr AFECCOSR AFEC Correction Select Register
@{*/

/** AFEC0_AFEC_COSR_CSEL Sample & Hold unit Correction Select **/
#define AFEC0_AFEC_COSR_CSEL		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_cvr AFECCVR AFEC Correction Values Register
@{*/


#define AFEC0_AFEC_CVR_GAINCORR_SHIFT		16
#define AFEC0_AFEC_CVR_GAINCORR_MASK		0xffff
/** @defgroup afec0_afec_cvr_gaincorr GAINCORR Gain Correction
@{*/
/**@}*/


#define AFEC0_AFEC_CVR_OFFSETCORR_SHIFT		0
#define AFEC0_AFEC_CVR_OFFSETCORR_MASK		0xffff
/** @defgroup afec0_afec_cvr_offsetcorr OFFSETCORR Offset Correction
@{*/
/**@}*/


/**@}*/

/** @defgroup afec0_afec_cecr AFECCECR AFEC Channel Error Correction Register
@{*/

/** AFEC0_AFEC_CECR_ECORR11 Error Correction Enable for channel 11 **/
#define AFEC0_AFEC_CECR_ECORR11		(1 << 11)
/** AFEC0_AFEC_CECR_ECORR10 Error Correction Enable for channel 10 **/
#define AFEC0_AFEC_CECR_ECORR10		(1 << 10)
/** AFEC0_AFEC_CECR_ECORR9 Error Correction Enable for channel 9 **/
#define AFEC0_AFEC_CECR_ECORR9		(1 << 9)
/** AFEC0_AFEC_CECR_ECORR8 Error Correction Enable for channel 8 **/
#define AFEC0_AFEC_CECR_ECORR8		(1 << 8)
/** AFEC0_AFEC_CECR_ECORR7 Error Correction Enable for channel 7 **/
#define AFEC0_AFEC_CECR_ECORR7		(1 << 7)
/** AFEC0_AFEC_CECR_ECORR6 Error Correction Enable for channel 6 **/
#define AFEC0_AFEC_CECR_ECORR6		(1 << 6)
/** AFEC0_AFEC_CECR_ECORR5 Error Correction Enable for channel 5 **/
#define AFEC0_AFEC_CECR_ECORR5		(1 << 5)
/** AFEC0_AFEC_CECR_ECORR4 Error Correction Enable for channel 4 **/
#define AFEC0_AFEC_CECR_ECORR4		(1 << 4)
/** AFEC0_AFEC_CECR_ECORR3 Error Correction Enable for channel 3 **/
#define AFEC0_AFEC_CECR_ECORR3		(1 << 3)
/** AFEC0_AFEC_CECR_ECORR2 Error Correction Enable for channel 2 **/
#define AFEC0_AFEC_CECR_ECORR2		(1 << 2)
/** AFEC0_AFEC_CECR_ECORR1 Error Correction Enable for channel 1 **/
#define AFEC0_AFEC_CECR_ECORR1		(1 << 1)
/** AFEC0_AFEC_CECR_ECORR0 Error Correction Enable for channel 0 **/
#define AFEC0_AFEC_CECR_ECORR0		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_wpmr AFECWPMR AFEC Write Protection Mode Register
@{*/


#define AFEC0_AFEC_WPMR_WPKEY_SHIFT		8
#define AFEC0_AFEC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup afec0_afec_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** AFEC0_AFEC_WPMR_WPEN Write Protection Enable **/
#define AFEC0_AFEC_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup afec0_afec_wpsr AFECWPSR AFEC Write Protection Status Register
@{*/


#define AFEC0_AFEC_WPSR_WPVSRC_SHIFT		8
#define AFEC0_AFEC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup afec0_afec_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** AFEC0_AFEC_WPSR_WPVS Write Protect Violation Status **/
#define AFEC0_AFEC_WPSR_WPVS		(1 << 0)

/**@}*/
